---
title: "Daily Physics Problem #1"
date: 2026 - 01 - 03
---

## Problem

길이 $L$, 단위길이당 질량밀도 $\rho$ 인 줄의 한 쪽 끝이 수직으로 매달려 있다.
장력을 줄의 놈이에 대한 함수로 구하여라

---

## Hint

줄의 끝점에서부터 높이 $y$인 지점에서 미소길이의 줄에 대해 운동방정식을 세워보자.

---

## Solution

높이 $y$인 지점에서 줄에 작용하는 장력을 $T(y)$라고 해보자. 
이 때 미소길이의 줄에 작용하는 힘은 윗 방향으로 장력 $T(y+dy)$, 아랫 방향으로 장력 $T(y)$, 아래로 중력 $\rho gdy$만큼 작용한다.
따라서 이를 기준으로 운동방정식을 세우면 아래와 같다.

$T(y+dy) - T(y) = \rho gdy$

$\frac{T(y+dy) - T(y)}{dy} = \rho g$

이 미분방정식을 풀면 $T(y) = \rho gy$가 된다.
실제로 $y$에 값을 대입해보면 $y=0$일 때 $T(0)=0$이고, $y=L$일 때 $T(L)=\rho gL$이다.

---

## Bonus Problem

탄성계수가 $k$로 일정한 용수철이 있다. 
용수철을 수직으로 매달아놓았을 때 용수철의 감긴 밀도를 높이에 따라 구하시오.

&#8251; 보너스 문제의 해설은 다음날에 기제됩니다.
